apache/nuttx/arch/arm/src/gd32f4/gd32f4xx_serial.c
/* This describes the state of the GD32 UART6 port. */

#ifdef CONFIG_GD32F4_UART6_SERIALDRIVER

static struct up_dev_s g_uart6priv =
{
  .oversamp      = USART_OVSMOD_16,
  .usartbase     = GD32_UART6,
  .baud          = CONFIG_UART6_BAUD,
  .clock         = GD32_PCLK1_FREQUENCY,
  .irq           = GD32_IRQ_UART6,
  .parity        = CONFIG_UART6_PARITY,
  .bits          = CONFIG_UART6_BITS,
  .stop_2bits    = CONFIG_UART6_2STOP,

  .tx_gpio       = GPIO_UART6_TX,
  .rx_gpio       = GPIO_UART6_RX,
  .lock          = SP_UNLOCKED,
#if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_UART6_IFLOWCONTROL)
  .iflow         = true,
  .rts_gpio      = GPIO_UART6_RTS,
#endif
#if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_UART6_OFLOWCONTROL)
  .oflow         = true,
  .cts_gpio      = GPIO_UART6_CTS,
#endif
#ifdef CONFIG_GD32F4_UART6_TXDMA
  .txdma_channel = DMA_CHANNEL_UART6_TX,
#endif
#ifdef CONFIG_GD32F4_UART6_RXDMA
  .rxdma_channel = DMA_CHANNEL_UART6_TX,
  .rxfifo        = g_uart6rxfifo,
#endif

#ifdef CONFIG_UART6_RS485
  .rs485_dir_gpio = GPIO_UART6_RS485_DIR,
#  if (CONFIG_UART6_RS485_DIR_POLARITY == 0)
  .rs485_dir_polarity = false,
#  else
  .rs485_dir_polarity = true,
#  endif
#endif
};

static struct uart_dev_s g_uart6port =
{
#if defined(CONSOLE_UART) && CONSOLE_UART == 6
  .isconsole = true,
#endif
  .recv      =
  {
    .size    = CONFIG_UART6_RXBUFSIZE,
    .buffer  = g_uart6rxbuffer,
  },
  .xmit      =
  {
    .size    = CONFIG_UART6_TXBUFSIZE,
    .buffer  = g_uart6txbuffer,
  },
#if defined(CONFIG_GD32F4_UART6_RXDMA) && defined(CONFIG_GD32F4_UART6_TXDMA)
  .ops       = &g_uart_ops_rxtx_dma,
#elif defined(CONFIG_GD32F4_UART6_RXDMA) && !defined(CONFIG_GD32F4_UART6_TXDMA)
  .ops       = &g_uart_ops_rx_dma,
#elif !defined(CONFIG_GD32F4_UART6_RXDMA) && defined(CONFIG_GD32F4_UART6_TXDMA)
  .ops       = &g_uart_ops_tx_dma,
#else
  .ops       = &g_uart_ops_no_dma,
#endif
  .priv      = &g_uart6priv,
};

#endif

/* This describes the state of the GD32 UART7 port. */

#ifdef CONFIG_GD32F4_UART7_SERIALDRIVER

static struct up_dev_s g_uart7priv =
{
  .oversamp      = USART_OVSMOD_16,
  .usartbase     = GD32_UART7,
  .baud          = CONFIG_UART7_BAUD,
  .clock         = GD32_PCLK1_FREQUENCY,
  .irq           = GD32_IRQ_UART7,
  .parity        = CONFIG_UART7_PARITY,
  .bits          = CONFIG_UART7_BITS,
  .stop_2bits    = CONFIG_UART7_2STOP,

  .tx_gpio       = GPIO_UART7_TX,
  .rx_gpio       = GPIO_UART7_RX,
  .lock          = SP_UNLOCKED,
#if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_UART7_IFLOWCONTROL)
  .iflow         = true,
  .rts_gpio      = GPIO_UART7_RTS,
#endif
#if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_UART7_OFLOWCONTROL)
  .oflow         = true,
  .cts_gpio      = GPIO_UART7_CTS,
#endif
#ifdef CONFIG_GD32F4_UART7_TXDMA
  .txdma_channel = DMA_CHANNEL_UART7_TX,
#endif
#ifdef CONFIG_GD32F4_UART7_RXDMA
  .rxdma_channel = DMA_CHANNEL_UART7_TX,
  .rxfifo        = g_uart7rxfifo,
#endif

#ifdef CONFIG_UART7_RS485
  .rs485_dir_gpio = GPIO_UART7_RS485_DIR,
#  if (CONFIG_UART7_RS485_DIR_POLARITY == 0)
  .rs485_dir_polarity = false,
#  else
  .rs485_dir_polarity = true,
#  endif
#endif
};

static struct uart_dev_s g_uart7port =
{
#if defined(CONSOLE_UART) && CONSOLE_UART == 7
  .isconsole = true,
#endif
  .recv      =
  {
    .size    = CONFIG_UART7_RXBUFSIZE,
    .buffer  = g_uart7rxbuffer,
  },
  .xmit      =
  {
    .size    = CONFIG_UART7_TXBUFSIZE,
    .buffer  = g_uart7txbuffer,
  },
#if defined(CONFIG_GD32F4_UART7_RXDMA) && defined(CONFIG_GD32F4_UART7_TXDMA)
  .ops       = &g_uart_ops_rxtx_dma,
#elif defined(CONFIG_GD32F4_UART7_RXDMA) && !defined(CONFIG_GD32F4_UART7_TXDMA)
  .ops       = &g_uart_ops_rx_dma,
#elif !defined(CONFIG_GD32F4_UART7_RXDMA) && defined(CONFIG_GD32F4_UART7_TXDMA)
  .ops       = &g_uart_ops_tx_dma,
#else
  .ops       = &g_uart_ops_no_dma,
#endif
  .priv      = &g_uart7priv,
};

#endif

/* This table lets us iterate over the configured USARTs */

static struct uart_dev_s * const g_uart_devs[GD32_NUSART] =
{
#ifdef CONFIG_GD32F4_USART0_SERIALDRIVER
  [0] = &g_usart0port,
#endif
#ifdef CONFIG_GD32F4_USART1_SERIALDRIVER
  [1] = &g_usart1port,
#endif
#ifdef CONFIG_GD32F4_USART2_SERIALDRIVER
  [2] = &g_usart2port,
#endif
#ifdef CONFIG_GD32F4_UART3_SERIALDRIVER
  [3] = &g_uart3port,
#endif
#ifdef CONFIG_GD32F4_UART4_SERIALDRIVER
  [4] = &g_uart4port,
#endif
#ifdef CONFIG_GD32F4_USART5_SERIALDRIVER
  [5] = &g_usart5port,
#endif
#ifdef CONFIG_GD32F4_UART6_SERIALDRIVER
  [6] = &g_uart6port,
#endif
#ifdef CONFIG_GD32F4_UART7_SERIALDRIVER
  [7] = &g_uart7port,
#endif
};

#ifdef CONFIG_PM
static  struct pm_callback_s g_serial_pmcb =
{
  .notify  = up_pm_notify,
  .prepare = up_pm_prepare,
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: up_serialin
 ****************************************************************************/

static inline uint32_t up_serialin(struct up_dev_s *priv, int offset)
{
  return getreg32(priv->usartbase + offset);
}

/****************************************************************************
 * Name: up_serialout
 ****************************************************************************/

static inline void up_serialout(struct up_dev_s *priv, int offset,
                                uint32_t value)
{
  putreg32(value, priv->usartbase + offset);
}

/****************************************************************************
 * Name: up_setusartint
 ****************************************************************************/

static void up_setusartint(struct up_dev_s *priv, uint32_t ie)
{
  uint8_t ctl;
  uint32_t ctl_ie;
  uint32_t regval;

  /* Save the USART interrupts */

  priv->ie = ie;

  ctl = (USART_CFG_CTL_MASK & (ie >> USART_CFG_SHIFT));

  /* Set interrupt in CTL0 register */

  if (USART_CFG_CTL0_INT == (ctl & USART_CFG_CTL0_INT))
    {
      ctl_ie = (ie << USART_CFG_CTL0_INT_SHIFT);
      regval  = up_serialin(priv, GD32_USART_CTL0_OFFSET);
      regval &= ~(USART_CTL0_USED_INTS);
      regval |= (ctl_ie & (USART_CTL0_USED_INTS));
      up_serialout(priv, GD32_USART_CTL0_OFFSET, regval);
    }

  /* Set interrupt in CTL1 register */

  if (USART_CFG_CTL1_INT == (ctl & USART_CFG_CTL1_INT))
    {
      ctl_ie = (ie << USART_CFG_CTL1_INT_SHIFT);
      regval  = up_serialin(priv, GD32_USART_CTL1_OFFSET);
      regval &= ~(USART_CTL1_USED_INTS);
      regval |= (ctl_ie & (USART_CTL1_USED_INTS));
      up_serialout(priv, GD32_USART_CTL1_OFFSET, regval);
    }

  /* Set interrupt in CTL2 register */

