apache/nuttx/arch/arm/src/gd32f4/gd32f4xx_serial.c
  if (USART_CFG_CTL2_INT == (ctl & USART_CFG_CTL2_INT))
    {
      ctl_ie = (ie >> USART_CFG_CTL2_INT_SHIFT);
      regval  = up_serialin(priv, GD32_USART_CTL2_OFFSET);
      regval &= ~(USART_CTL2_USED_INTS);
      regval |= (ctl_ie & (USART_CTL2_USED_INTS));
      up_serialout(priv, GD32_USART_CTL2_OFFSET, regval);
    }

  /* Set interrupt in CTL3 register */

  if (USART_CFG_CTL3_INT == (ctl & USART_CFG_CTL3_INT))
    {
      ctl_ie = (ie >> USART_CFG_CTL3_INT_SHIFT);
      regval  = up_serialin(priv, GD32_USART_CTL3_OFFSET);
      regval &= ~(USART_CTL3_USED_INTS);
      regval |= (ctl_ie & (USART_CTL3_USED_INTS));
      up_serialout(priv, GD32_USART_CTL3_OFFSET, regval);
    }
}

/****************************************************************************
 * Name: up_disableusartint
 ****************************************************************************/

static void up_disableusartint(struct up_dev_s *priv, uint32_t *ie)
{
  irqstate_t flags;
  uint32_t ctl_ie;

  flags = spin_lock_irqsave(&priv->lock);

  if (ie)
    {
      uint32_t ctl;

      ctl_ie = 0;

      /* Save interrupt in CTL0 register */

      ctl = up_serialin(priv, GD32_USART_CTL0_OFFSET);
      if (ctl & USART_CTL0_USED_INTS)
        {
          ctl_ie |= ((ctl & USART_CTL0_USED_INTS) >>
                       USART_CFG_CTL0_INT_SHIFT);
          ctl_ie |= (USART_CFG_CTL0_INT << USART_CFG_SHIFT);
        }

      /* Save interrupt in CTL1 register */

      ctl = up_serialin(priv, GD32_USART_CTL1_OFFSET);
      if (ctl & USART_CTL1_USED_INTS)
        {
          ctl_ie |= ((ctl & USART_CTL1_USED_INTS) >>
                       USART_CFG_CTL1_INT_SHIFT);
          ctl_ie |= (USART_CFG_CTL1_INT << USART_CFG_SHIFT);
        }

      /* Save interrupt in CTL2 register */

      ctl = up_serialin(priv, GD32_USART_CTL2_OFFSET);
      if (ctl & USART_CTL2_USED_INTS)
        {
          ctl_ie |= ((ctl & USART_CTL2_USED_INTS) <<
                       USART_CFG_CTL2_INT_SHIFT);
          ctl_ie |= (USART_CFG_CTL2_INT << USART_CFG_SHIFT);
        }

      /* Save interrupt in CTL3 register */

      ctl = up_serialin(priv, GD32_USART_CTL3_OFFSET);
      if (ctl & USART_CTL3_USED_INTS)
        {
          ctl_ie |= ((ctl & USART_CTL3_USED_INTS) <<
                       USART_CFG_CTL3_INT_SHIFT);
          ctl_ie |= (USART_CFG_CTL3_INT << USART_CFG_SHIFT);
        }

      *ie = ctl_ie;
    }

  /* Disable all interrupts */

  ctl_ie = (USART_CFG_CTL_MASK << USART_CFG_SHIFT);
  up_setusartint(priv, ctl_ie);

  spin_unlock_irqrestore(&priv->lock, flags);
}

/****************************************************************************
 * Name: up_restoreusartint
 ****************************************************************************/

static void up_restoreusartint(struct up_dev_s *priv, uint32_t ie)
{
  irqstate_t flags;

  flags = spin_lock_irqsave(&priv->lock);

  up_setusartint(priv, ie);

  spin_unlock_irqrestore(&priv->lock, flags);
}

/****************************************************************************
 * Name: up_dma_nextrx
 *
 * Description:
 *   Returns the index into the RX FIFO where the DMA will place the next
 *   byte that it receives.
 *
 ****************************************************************************/

#ifdef SERIAL_HAVE_RXDMA
static int up_dma_nextrx(struct up_dev_s *priv)
{
  size_t dmacount;

  dmacount = gd32_dma_tansnum_get(priv->rxdma);

  return (RXDMA_BUFFER_SIZE - (int)dmacount);
}
#endif

/****************************************************************************
 * Name: gd32_usart_configure
 *
 * Description:
 *   Configure the USART.
 *
 ****************************************************************************/

#ifndef CONFIG_SUPPRESS_UART_CONFIG
static void gd32_usart_configure(struct uart_dev_s *dev)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;

  uint32_t udiv;
  uint32_t intdiv;
  uint32_t fradiv;
  uint32_t regval;

  /* Configure the USART oversample mode. */

  regval = up_serialin(priv, GD32_USART_CTL0_OFFSET);
  regval &= ~(USART_CTL0_OVSMOD);
  regval |= priv->oversamp;
  up_serialout(priv, GD32_USART_CTL0_OFFSET, regval);

  /* Configure USART baud rate value */

  if ((priv->oversamp & USART_CTL0_OVSMOD) == USART_OVSMOD_8)
    {
      /* When oversampling by 8, configure the value of USART_BAUD */

      udiv = ((priv->clock * 2) + priv->baud / 2) / priv->baud;
      intdiv = udiv & 0xfff0;
      fradiv = (udiv >> 1) & 0x7u;
    }
  else
    {
      /* When oversampling by 16, configure the value of USART_BAUD */

      udiv = (priv->clock + priv->baud / 2) / priv->baud;
      intdiv = udiv & 0xfff0;
      fradiv = udiv & 0xf;
    }

  regval = ((USART_BAUD_FRADIV_MASK | USART_BAUD_INTDIV_MASK) &
            (intdiv | fradiv));
  up_serialout(priv, GD32_USART_BAUD_OFFSET, regval);

  /* Configure parity mode */

  regval = up_serialin(priv, GD32_USART_CTL0_OFFSET);
  regval &= ~(USART_CTL0_PM_MASK | USART_CTL0_WL);

  if (priv->parity == 1)
    {
      /* Configure as odd parity */

      regval |= USART_CTL0_PM_ODD;
    }
  else if (priv->parity == 2)
    {
      /* Configure as even parity */

      regval |= USART_CTL0_PM_EVEN;
    }

  /* Configure USART word length */

  if (priv->bits == 9 || (priv->bits == 8 && priv->parity != 0))
    {
      regval |= USART_WL_9BIT;
    }
  else
    {
      regval |= USART_WL_8BIT;
    }

  up_serialout(priv, GD32_USART_CTL0_OFFSET, regval);

  /* Configure STOP bits */

  regval = up_serialin(priv, GD32_USART_CTL1_OFFSET);
  regval &= ~(USART_CTL1_STB_MASK);

  if (priv->stop_2bits)
    {
      regval |= USART_CTL1_STB2BIT;
    }

  up_serialout(priv, GD32_USART_CTL1_OFFSET, regval);

  /* Configure hardware flow control */

  regval  = up_serialin(priv, GD32_USART_CTL2_OFFSET);
  regval &= ~(USART_CTL2_RTSEN | USART_CTL2_CTSEN);

#if defined(CONFIG_SERIAL_IFLOWCONTROL) && \
   !defined(CONFIG_GD32F4_FLOWCONTROL_BROKEN)
  if (priv->iflow && (priv->rts_gpio != 0))
    {
      regval |= USART_CTL2_RTSEN;
    }
#endif

#ifdef CONFIG_SERIAL_OFLOWCONTROL
  if (priv->oflow && (priv->cts_gpio != 0))
    {
      regval |= USART_CTL2_CTSEN;
    }
#endif

  up_serialout(priv, GD32_USART_CTL2_OFFSET, regval);
}
#endif /* CONFIG_SUPPRESS_UART_CONFIG */

/****************************************************************************
 * Name: up_setup
 *
 * Description:
 *   Configure the USART baud, bits, parity, etc. This method is called the
 *   first time that the serial port is opened.
 *
 ****************************************************************************/

