apache/nuttx/arch/arm/src/gd32f4/gd32f4xx_serial.c
      /* Release the TX DMA channel */

      gd32_dma_channel_free(priv->txdma);
      priv->txdma = NULL;
    }
#endif
}
#endif

/****************************************************************************
 * Name: up_attach
 *
 * Description:
 *   Configure the USART to operation in interrupt driven mode.  This method
 *   is called when the serial port is opened.  Normally, this is just after
 *   the setup() method is called, however, the serial console may operate
 *   in a non-interrupt driven mode during the boot phase.
 *
 *   RX and TX interrupts are not enabled when by the attach method (unless
 *   the hardware supports multiple levels of interrupt enabling).  The RX
 *   and TX interrupts are not enabled until the txint() and rxint() methods
 *   are called.
 *
 ****************************************************************************/

static int up_attach(struct uart_dev_s *dev)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;
  int ret;

  /* Attach and enable the IRQ */

  ret = irq_attach(priv->irq, up_interrupt, dev);
  if (ret == OK)
    {
      /* Enable the interrupt (RX and TX interrupts are still disabled
       * in the USART
       */

      up_enable_irq(priv->irq);
    }

  return ret;
}

/****************************************************************************
 * Name: up_detach
 *
 * Description:
 *   Detach USART interrupts.  This method is called when the serial port is
 *   closed normally just before the shutdown method is called.  The
 *   exception is the serial console which is never shutdown.
 *
 ****************************************************************************/

static void up_detach(struct uart_dev_s *dev)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;
  up_disable_irq(priv->irq);
  irq_detach(priv->irq);
}

/****************************************************************************
 * Name: up_interrupt
 *
 * Description:
 *   This is the UART interrupt handler.  It will be invoked when an
 *   interrupt is received on the 'irq'.  It should call uart_xmitchars or
 *   uart_recvchars to perform the appropriate data transfers.  The
 *   interrupt handling logic must be able to map the 'arg' to the
 *   appropriate uart_dev_s structure in order to call these functions.
 *
 ****************************************************************************/

static int up_interrupt(int irq, void *context, void *arg)
{
  struct uart_dev_s *dev = (struct uart_dev_s *)arg;
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;
  int  passes;
  bool handled;

  DEBUGASSERT(dev != NULL && priv != NULL);

#if defined(CONFIG_PM) && CONFIG_GD32F4_PM_SERIAL_ACTIVITY > 0
  /* Report serial activity to the power management logic */

  pm_activity(PM_IDLE_DOMAIN, CONFIG_GD32F4_PM_SERIAL_ACTIVITY);
#endif

  /* Loop until there are no characters to be transferred or,
   * until we have been looping for a long time.
   */

  handled = true;
  for (passes = 0; passes < 256 && handled; passes++)
    {
      handled = false;

      /* Get the current USART status. */

      priv->sr = up_serialin(priv, GD32_USART_STAT0_OFFSET);

#ifdef HAVE_RS485
      /* Transmission is complete. */

      if (((priv->sr & USART_STAT0_TC) != 0) &&
          ((priv->ie & USART_CFG_CTL0_INT_TCIE) ==
            USART_CFG_CTL0_INT_TCIE) &&
          ((priv->ie & USART_CFG_CTL0_INT_TBEIE) !=
            USART_CFG_CTL0_INT_TBEIE))
        {
          gd32_gpio_write(priv->rs485_dir_gpio, !priv->rs485_dir_polarity);
          priv->ie &= ~USART_CFG_CTL0_INT_TCIE
          priv->ie |= (0x0f000000 & USART_CFG_CTL0_INT_TCIE);
          up_restoreusartint(priv, priv->ie);
        }
#endif

      /* Handle incoming, receive bytes. */

      if (((priv->sr & USART_STAT0_RBNE) != 0) &&
          ((priv->ie & USART_CFG_CTL0_INT_RBNEIE) ==
            USART_CFG_CTL0_INT_RBNEIE))
        {
          uart_recvchars(dev);
          handled = true;
        }

#ifdef SERIAL_HAVE_RXDMA
      if (((priv->sr & USART_STAT0_IDLEF) != 0) &&
          ((priv->ie & USART_CFG_CTL0_INT_IDLIE) ==
            USART_CFG_CTL0_INT_IDLIE))
        {
          uart_recvchars(dev);
          up_serialin(priv, GD32_USART_DATA_OFFSET);
          handled = true;
        }
#endif

      /* Clear USART err flags. */

      else if ((priv->sr & (USART_STAT0_ORERR | USART_STAT0_NERR | \
                            USART_STAT0_FERR | USART_STAT0_PERR)) != 0)
        {
          up_serialin(priv, GD32_USART_DATA_OFFSET);
        }

      /* Handle outgoing, transmit bytes */

      if (((priv->sr & USART_STAT0_TBE) != 0) &&
          ((priv->ie & USART_CFG_CTL0_INT_TBEIE) ==
           USART_CFG_CTL0_INT_TBEIE))
        {
          uart_xmitchars(dev);
          handled = true;
        }
    }

  return OK;
}

/****************************************************************************
 * Name: up_ioctl
 *
 * Description:
 *   All ioctl calls will be routed through this method
 *
 ****************************************************************************/

static int up_ioctl(struct file *filep, int cmd, unsigned long arg)
{
#if defined(CONFIG_SERIAL_TERMIOS) || defined(CONFIG_SERIAL_TIOCSERGSTRUCT) \
    || defined(CONFIG_GD32F4_SERIALBRK_BSDCOMPAT)
  struct inode      *inode = filep->f_inode;
  struct uart_dev_s *dev   = inode->i_private;
#endif
#if defined(CONFIG_SERIAL_TERMIOS) || defined(CONFIG_GD32F4_SERIALBRK_BSDCOMPAT)
  struct up_dev_s   *priv  = (struct up_dev_s *)dev->priv;
#endif
  uint32_t regval;
  int ret    = OK;

  switch (cmd)
    {
#ifdef CONFIG_SERIAL_TIOCSERGSTRUCT
    case TIOCSERGSTRUCT:
      {
        struct up_dev_s *user = (struct up_dev_s *)arg;
        if (!user)
          {
            ret = -EINVAL;
          }
        else
          {
            memcpy(user, dev, sizeof(struct up_dev_s));
          }
      }
      break;
#endif

#ifdef CONFIG_GD32F4_USART_SINGLEWIRE
    case TIOCSSINGLEWIRE:
      {
        /* Change to single-wire operation. the RX pin is disconnected from
         * the USART and the UUSARTART implements a half-duplex serial
         * connection. The USART uses the TX pin for both receiving and
         * transmitting.
         */

        regval = up_serialin(priv, GD32_USART_CTL2_OFFSET);

        if ((arg & SER_SINGLEWIRE_ENABLED) != 0)
          {
            uint32_t gpio_val = (arg & SER_SINGLEWIRE_PUSHPULL) ==
                                 SER_SINGLEWIRE_PUSHPULL ?
                                 GPIO_CFG_PP : GPIO_CFG_OD;
            gpio_val |= ((arg & SER_SINGLEWIRE_PULL_MASK) ==
                         SER_SINGLEWIRE_PULLUP) ? GPIO_CFG_PUPD_PULLUP
                                                : GPIO_CFG_PUPD_NONE;
            gpio_val |= ((arg & SER_SINGLEWIRE_PULL_MASK) ==
                         SER_SINGLEWIRE_PULLDOWN) ? GPIO_CFG_PUPD_PULLDOWN
                                                  : GPIO_CFG_PUPD_NONE;
            gd32_gpio_config((priv->tx_gpio & ~(GPIO_CFG_ODPP_MASK |
                                                GPIO_CFG_PUPD_MASK)) |
                              gpio_val);
            regval |= USART_CTL2_HDEN;
          }
        else
          {
            gd32_gpio_config((priv->tx_gpio & ~(GPIO_CFG_ODPP_MASK |
                                                GPIO_CFG_PUPD_MASK)) |
                              GPIO_CFG_PP);
            regval &= ~USART_CTL2_HDEN;
          }

        up_serialout(priv, GD32_USART_CTL2_OFFSET, regval);
      }
     break;
#endif

#ifdef CONFIG_SERIAL_TERMIOS
    case TCGETS:
      {
        struct termios *termiosp = (struct termios *)arg;

        if (!termiosp)
          {
            ret = -EINVAL;
            break;
          }

        /* The driver only support 8/9 bit modes and therefore is
         * no way to report 9-bit mode, we always claim 8.
         */

